vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA355_DFP.pdsc
    <condition id="component.sgi_pkc.pkc.condition_id">
      <require condition="allOf.device=MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.pre_processor.condition_id">
      <require condition="allOf.device=MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.prng.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.random, component.sgi_pkc.secure_counter, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.random, component.sgi_pkc.secure_counter, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.random.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.flow_protection, component.sgi_pkc.memory, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.random_modes.condition_id">
      <require condition="allOf.component.sgi_pkc.crc, component.sgi_pkc.random, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.crc, component.sgi_pkc.random, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.resource.condition_id">
      <require condition="allOf.component.sgi_pkc.buffer, component.sgi_pkc.dma, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.buffer, component.sgi_pkc.dma, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_buffer"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_dma"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.rsa.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.hash, component.sgi_pkc.signature, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.hash, component.sgi_pkc.signature, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_hash"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_signature"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.secure_counter.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.session.condition_id">
      <require condition="allOf.component.sgi_pkc.crc, component.sgi_pkc.flow_protection, component.sgi_pkc.random, component.sgi_pkc.resource, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.crc, component.sgi_pkc.flow_protection, component.sgi_pkc.random, component.sgi_pkc.resource, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_crc"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_random"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_resource"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.sgi_pkc.condition_id">
      <require condition="allOf.device=MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.signature.condition_id">
      <require condition="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.component.sgi_pkc.flow_protection, component.sgi_pkc.pre_processor, component.sgi_pkc.secure_counter, component.sgi_pkc.toolchain, device=MCXA355.internal_condition">
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_flow_protection"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_pre_processor"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_secure_counter"/>
      <require Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="component.sgi_pkc.toolchain.condition_id">
      <require condition="allOf.device=MCXA355.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer, component.lists, driver.common, device=MCXA355.internal_condition">
      <require condition="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ctimer_adapter, driver.ctimer, allOf=component.lptmr_adapter, driver.lptmr, allOf=component.ostimer_adapter, driver.ostimer.internal_condition">
      <accept condition="allOf.component.ctimer_adapter, driver.ctimer.internal_condition"/>
      <accept condition="allOf.component.lptmr_adapter, driver.lptmr.internal_condition"/>
      <accept condition="allOf.component.ostimer_adapter, driver.ostimer.internal_condition"/>
    </condition>
    <condition id="allOf.component.ctimer_adapter, driver.ctimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer"/>
    </condition>
    <condition id="allOf.component.lptmr_adapter, driver.lptmr.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lptmr"/>
    </condition>
    <condition id="allOf.component.ostimer_adapter, driver.ostimer.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXA355.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXA355.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXA355.internal_condition"/>
    </condition>
    <condition id="device_id.MCXA355.internal_condition">
      <accept Dname="MCXA355VLH" Dvendor="NXP:11"/>
      <accept Dname="MCXA355VLL" Dvendor="NXP:11"/>
      <accept Dname="MCXA355VLQ" Dvendor="NXP:11"/>
      <accept Dname="MCXA355VPN" Dvendor="NXP:11"/>
    </condition>
