vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA355_DFP.pdsc
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_session" Cversion="1.0.0" condition="component.sgi_pkc.session.condition_id">
      <description>Component sgi_pkc.session</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/mcuxClSession_jobHandling.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSession/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/size"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Entry_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="sourceAsm" name="components/sgi_pkc/src/comps/mcuxClSession/src/asm/mcuxClSession_Internal_EntryExit_EarlyExit_Return_arm.S" projectpath="component/sgi_pkc/src/comps/mcuxClSession/src/asm"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_FeatureConfig.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_EntryExit_EarlyExit_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSession/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSession/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_sgi_pkc" Cversion="1.0.0" condition="component.sgi_pkc.sgi_pkc.condition_id">
      <description>Component sgi_pkc</description>
      <files>
        <file category="doc" name="components/sgi_pkc/component.sgi_pkc.sgi_pkc_dummy.txt"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_signature" Cversion="1.0.0" condition="component.sgi_pkc.signature.condition_id">
      <description>Component sgi_pkc.signature</description>
      <files>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/mcuxClSignature.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src"/>
        <file category="sourceC" name="components/sgi_pkc/src/comps/mcuxClSignature/src/size/size.c" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/src/size"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Constants.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Functions.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/mcuxClSignature_Types.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc"/>
        <file category="header" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/mcuxClSignature_Internal.h" projectpath="component/sgi_pkc/src/comps/mcuxClSignature/inc/internal"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/"/>
        <file category="include" name="components/sgi_pkc/src/comps/mcuxClSignature/inc/internal/"/>
      </files>
    </component>
    <component Cclass="sgi_pkc" Cgroup="sgi_pkc_toolchain" Cversion="1.0.0" condition="component.sgi_pkc.toolchain.condition_id">
      <description>Component sgi_pkc toolchain</description>
      <files>
        <file category="header" name="components/sgi_pkc/src/compiler/mcuxClToolchain.h" projectpath="component/sgi_pkc/src/compiler"/>
        <file category="include" name="components/sgi_pkc/"/>
        <file category="include" name="components/sgi_pkc/src/compiler/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA355_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device MCXA355_cmsis</description>
      <files>
        <file category="header" name="devices/MCXA355/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/MCXA355/MCXA355.h" projectpath="device"/>
        <file category="header" name="devices/MCXA355/MCXA355_features.h" projectpath="device"/>
        <file category="header" name="devices/MCXA355/MCXA355_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_AOI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_CDOG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_CMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_CTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_DEBUGMAILBOX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_DIGTMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_EIM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_EQDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_ERM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_FLEXIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_FMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_FMU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_FREQME.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_GLIKEY.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_I3C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_INPUTMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LCD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LPCMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LPDAC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LPI2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LPSPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LPTMR.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_LPUART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_MAU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_MRCC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_OPAMP.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_OSTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_PKC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_PORT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_PWM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_SCG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_SGI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_SMARTDMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_SPC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_SYSCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_TRDC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_TRNG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_UDF.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_UTICK.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_VBAT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_WAKETIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_WUU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/MCXA355/periph2/PERI_WWDT.h" projectpath="device/periph2"/>
        <file category="include" name="devices/MCXA355/"/>
        <file category="include" name="devices/MCXA355/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA355/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA355/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MCXA355_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MCXA355_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA355.condition_id" category="linkerScript" name="devices/MCXA355/arm/MCXA355_flash.scf" projectpath="MCXA355/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=MCXA355.condition_id" category="linkerScript" name="devices/MCXA355/arm/MCXA355_ram.scf" projectpath="MCXA355/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA355.condition_id" category="linkerScript" name="devices/MCXA355/gcc/MCXA355_flash.ld" projectpath="MCXA355/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=MCXA355.condition_id" category="linkerScript" name="devices/MCXA355/gcc/MCXA355_ram.ld" projectpath="MCXA355/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA355.condition_id" category="linkerScript" name="devices/MCXA355/iar/MCXA355_flash.icf" projectpath="MCXA355/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=MCXA355.condition_id" category="linkerScript" name="devices/MCXA355/iar/MCXA355_ram.icf" projectpath="MCXA355/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MCXA355" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MCXA355</description>
      <files>
        <file category="header" attr="config" name="devices/MCXA355/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA355/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA355/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA355/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA355/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA355/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MCXA355/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MCXA355/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MCXA355/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MCXA355_startup</description>
      <files>
        <file condition="allOf.toolchains=armgcc, iar, mdk.condition_id" category="sourceC" attr="config" name="devices/MCXA355/startup_MCXA355.c" version="1.0.0" projectpath="startup"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MCXA355_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MCXA355_system</description>
      <files>
        <file category="sourceC" name="devices/MCXA355/system_MCXA355.c" projectpath="device"/>
        <file category="header" name="devices/MCXA355/system_MCXA355.h" projectpath="device"/>
        <file category="include" name="devices/MCXA355/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MCXA355/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA355/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA355/drivers/"/>
      </files>
    </component>
