vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA355_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_ftp12557" Cversion="1.0.0" condition="driver.slcd_ftp12557.condition_id">
      <description>Driver slcd_ftp12557</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_FTP12557_H
#define SLCD_PANEL_FTP12557_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/FTP12557/FTP12557.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/FTP12557/FTP12557.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/FTP12557/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_gdh_1247wp" Cversion="1.0.1" condition="driver.slcd_gdh_1247wp.condition_id">
      <description>Driver slcd_gdh_1247wp</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_GDH_1247WP_H
#define SLCD_PANEL_GDH_1247WP_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/GDH-1247WP/GDH-1247WP.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/GDH-1247WP/GDH-1247WP.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/GDH-1247WP/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_lcd_s401m16kr" Cversion="1.0.2" condition="driver.slcd_lcd_s401m16kr.condition_id">
      <description>Driver slcd_lcd_s401m16kr</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_LCD_S401M16KR_H
#define SLCD_PANEL_LCD_S401M16KR_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/LCD-S401M16KR/LCD-S401M16KR.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/LCD-S401M16KR/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="slcd_od_6010" Cversion="1.0.0" condition="driver.slcd_od_6010.condition_id">
      <description>Driver slcd_od_6010</description>
      <RTE_Components_h>
#ifndef SLCD_PANEL_OD_6010_H
#define SLCD_PANEL_OD_6010_H 
#endif
</RTE_Components_h>
      <files>
        <file category="sourceC" name="components/slcd_engine/OD-6010/OD-6010.c" projectpath="slcd"/>
        <file category="header" name="components/slcd_engine/OD-6010/OD-6010.h" projectpath="slcd"/>
        <file category="include" name="components/slcd_engine/OD-6010/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma" Cversion="2.13.2" condition="driver.smartdma.condition_id">
      <description>SMARTDMA Driver</description>
      <files>
        <file category="header" name="devices/MCXA355/drivers/fsl_smartdma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA355/drivers/fsl_smartdma.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA355/drivers/fsl_smartdma_prv.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA355/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma_mcxa" Cversion="2.13.2" condition="driver.smartdma_mcxa.condition_id">
      <description>SMARTDMA Driver for MCXA SoCs</description>
      <files>
        <file category="sourceC" name="devices/MCXA355/drivers/fsl_smartdma_mcxa.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXA355/drivers/fsl_smartdma_mcxa.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXA355/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963" Cversion="1.2.0" condition="driver.ssd1963.condition_id">
      <description>Driver ssd1963</description>
      <files>
        <file category="header" name="components/display/ssd1963/fsl_ssd1963.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ssd1963/fsl_ssd1963.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="st7796s" Cversion="1.0.0" condition="driver.st7796s.condition_id">
      <description>Driver st7796s</description>
      <files>
        <file category="header" name="components/display/st7796s/fsl_st7796s.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/st7796s/fsl_st7796s.c" projectpath="lcdc"/>
        <file category="include" name="components/display/st7796s/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tdet" Cversion="2.2.0" condition="driver.tdet.condition_id">
      <description>TDET Driver</description>
      <files>
        <file category="header" name="devices/MCXA355/drivers/fsl_tdet.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA355/drivers/fsl_tdet.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA355/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tma525b" Cversion="1.0.0" condition="driver.tma525b.condition_id">
      <description>Driver tma525b</description>
      <files>
        <file category="header" name="components/touch/tma525b/fsl_tma525b.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/tma525b/fsl_tma525b.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/tma525b/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trdc" Cversion="2.2.1" condition="driver.trdc_1.condition_id">
      <description>TRDC Driver</description>
      <files>
        <file category="header" name="devices/MCXA355/drivers/fsl_trdc.h" projectpath="drivers"/>
        <file category="header" name="devices/MCXA355/drivers/fsl_trdc_core.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXA355/drivers/fsl_trdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXA355/drivers/"/>
      </files>
    </component>
